{
	"version": "https://jsonfeed.org/version/1.1",
	"title": "trademarkhell.net",
	"language": "en",
	"home_page_url": "https://trademarkhell.net/",
	"feed_url": "https://trademarkhell.net/feed/feed.json",
	"description": "ramblings from the 21st century",
	"author": {
		"name": "trademark",
		"url": "trademarkhell.net/"
	},
	"items": [
		{
			"id": "https://trademarkhell.net/blog/newwebdevs/",
			"url": "https://trademarkhell.net/blog/newwebdevs/",
			"title": "Advice for New Web Devs",
			"content_html": "<p>There's not really a formal set of guidelines to web development, and I don't intend to make them, rather, my intention with this article is to make it so you don't have to completely remake your site after 3 weeks as I did. I'll mostly be covering things on the back-end that help with convenience, but I will touch briefly on accessibility.</p>\n<p>The worst trend I've been seeing as of late has to do with iframes. Iframes themselves aren't bad, and can be very useful, but improper usage of them is terrible to work with and terrible for the user. Iframes should not be used as a substitute for seperate pages, this makes your site a royal pain to work on, and effectively makes the site useless to screen reader users. If you need a way to keep a consistent layout on every page, either make a boiler plate layout you can copy paste, or put your site into an SSG with a templating engine.</p>\n<p>On a similar templating note, make sure your site has a consistent navbar layout. It's fine to change the layout of the individual pages if you want to, but the navbar is effectively the core of how your site is operated. It's important for the layout of it to be consistent, as it allows the user to orient themselves, and if needed, return to a previous page. Don't be the type of person to have the navbar mysteriously disappear and just expect the user to go back manually, your site viewers are more lazy than you think.</p>\n<p>Another thing I feel a lot of new web developers (myself included, my first site was a war crime) forget, is that people have different screen sizes than you. Just because your site works perfectly on your 4K monitor doesn't mean that the majority of users on a 1080p monitor won't end up with a horizontal scrollbar. Generally speaking, don't make your website any wider than 1024px, this means that basically anyone, regardless of monitor, will be able to use your site without scrolling horizontally. Build your site down, not to the sides.</p>\n<p>On a similar note of screen variations, color temperature is another rather important one. About a month ago there was a rather interesting saga involving a user with a site that used grey text on a black background. This was perfectly legible for them, and anyone else using an OLED monitor, but for everyone else it was impossible to read. Stick to contrasting colors, there's a reason so many sites still go for grey and white and white and black.</p>\n<img src=\"https://trademarkhell.net/img/unlegible.png\" alt=\"black text on a grey background saying this isnt legible, sorry\" height=\"50px\" style=\"display: block; margin: 0 auto\">\n<p>This is on a very different note, but don't feel the need to push your site out right away, I published my first site after a few hours of working on it, and it had aproximately nothing of substance. There's no need to rush your website out, take your time to get all the links filled out, nobody's going to mind waiting a few days to see your site. A more complete site is always better than a site with twenty links that all lead to nothing but a &quot;sowwy coming soon&quot; page.</p>\n<p>I tried to hit all the bases of things I've noticed on others sites and from my old sites, but there's absolutely more things you'll end up learning through trial and error. If anyone else can think of some major things I missed, feel free to put them in the comments. TM out.</p>\n",
			"date_published": "2024-08-21T00:00:00Z"
		}
		,
		{
			"id": "https://trademarkhell.net/blog/ibm5160/",
			"url": "https://trademarkhell.net/blog/ibm5160/",
			"title": "A Brief Overview of the IBM 5160",
			"content_html": "<p>The IBM 5160, or, the IBM PC XT, is the direct successor to the IBM 5160, the IBM PC. There's technically some motherboard differences between the two, but in practice, the only real difference is that the IBM 5160 came from the factory with a HDD, as opposed to the IBM PC, which came with dual 5.25&quot; floppy drives. The IBM PC lineup has a very interesting history, but due to that deviating from the purpose of this article, all you really need to know is that the IBM PC was effectively the first readily available computer.</p>\n<h2 id=\"graphics\" tabindex=\"-1\">Graphics <a class=\"header-anchor\" href=\"https://trademarkhell.net/blog/ibm5160/\">#</a></h2>\n<p>The IBM PC XT was available with three different graphics cards, the Monochrome Display Adapter, the Color Graphics Adapter, and the Enhanced Graphics Adapter. The Monochrome Display Adapter, as the name suggests, gives you monochrome graphics, with 80 columns and 25 lines of text. It was intended to be paired with the IBM 5151, which was the stereotypical black and green terminal-esque monitor that we've grown used to seeing in games such as Fallout. The Color Graphics Adapter, despite what the name may infer, barely gives you color, only giving you a limited palette of four colors at 320x200 . It was designed with the IBM 5153 in mind, and you can see a photo of mine running Microsoft Flight Simulator 3 (1988) below, in all of it's ugly glory. (Pardon the reflection)</p>\n<img src=\"https://trademarkhell.net/img/fs3closeup.jpg\" alt=\"A photo of my IBM 5160 running MFS3 \" height=\"400px\" style=\"display: block; margin: 0 auto\">\n<p>That brings us to the last, and least commonly used adapter, the Enhanced Graphics Adapter, it gave you proper 16 color graphics at 320x200, although came in at a lofty price, and was made obsolete by VGA shortly after it's release. It was intended to be paired with the IBM 5154.</p>\n<p>In practice, all you really need to run the vast majority of IBM PC games is a CGA card, given it can display graphics, unlike the text-only MDA, however games will look much better with a EGA card, and if you're a heathen, a VGA card. What card you opt for really comes to budget and personal preference, I quite like the period-correct charm of the CGA card's graphics, but it's certainly an acquired taste.</p>\n<h2 id=\"ram\" tabindex=\"-1\">Ram <a class=\"header-anchor\" href=\"https://trademarkhell.net/blog/ibm5160/\">#</a></h2>\n<p>Ram is probably the most important thing outside of your graphics card of choice that determines if you can run a game or not. The IBM 5160 was limited to 640kb of ram, but, in practice, the majority of computers you'll find will have a maximum of 256KB. This can be remedied by relatively inexpensive ram chips, and I highly advise doing so, as 400kb of RAM can be the difference between a slideshow and an actually enjoyable game.</p>\n<h2 id=\"storage\" tabindex=\"-1\">Storage <a class=\"header-anchor\" href=\"https://trademarkhell.net/blog/ibm5160/\">#</a></h2>\n<p>The IBM 5160 was equipped from the factory with one 5mb HDD, and one 5.25&quot; floppy drive. 5MB likely sounds like very little storage, and in a world of 20MB flac files and 200GB games, it is, but at the time this was a rather impressive development. The earlier 5150 had no HDD, and exepcted the user to solely rely on a constant rotation of floppy disks, so this 5MB HDD effectively changed the way computers were operated.</p>\n<p>Odds are, however, this HDD will have lost it's magnetization many years ago by now, and will need to be replaced. This is where the wonders of modern technology make operating the computer much easier. Rather than hunting down an original HDD, you can install a XT-IDE card (or a offbrand, like i use), which allow you to use a compact flash card as your HDD. This means transferring files onto your IBM PC is as simple as dragging the files onto the compact flash card from your modern computer, and plugging it into the IBM PC.</p>\n<h2 id=\"is-there-any-realistic-use-case-for-this\" tabindex=\"-1\">Is There Any Realistic Use Case For This? <a class=\"header-anchor\" href=\"https://trademarkhell.net/blog/ibm5160/\">#</a></h2>\n<p>The IBM 5160 is a 41 year old piece of technology, and for the majority of tasks, completely useless. Despite this, I find a certain joy in playing through the vast catalogue of 80s DOS games on it, and at times, programming in C or BASIC You can do literally everything an IBM PC can on a new PC with DOSBox, but something just hits different about doing it on original hardware. It's just cool, I guess.</p>\n<h2 id=\"my-personal-setup\" tabindex=\"-1\">My Personal Setup <a class=\"header-anchor\" href=\"https://trademarkhell.net/blog/ibm5160/\">#</a></h2>\n<p>I personally run a fully recapped IBM 5160, with a CGA graphics card, a few other connectivity cards, a 3-COM Etherlink, which allows me to connect to BBS Boards through ethernet, an IBM Model M keyboard, 640KB of ram, a 500MB compact flash card, and a IBM 5153 monitor. For My personal needs, this is the ultimate setup, I find that it combines modern convenience with with reasonably believable period-correct hardware. There's nothing I can think of that I'd change with it.</p>\n<img src=\"https://trademarkhell.net/img/5160setup82024.png\" alt=\"My 5160 setup\" height=\"400px\" style=\"display: block; margin: 0 auto\">\n<h2 id=\"conclusion\" tabindex=\"-1\">Conclusion <a class=\"header-anchor\" href=\"https://trademarkhell.net/blog/ibm5160/\">#</a></h2>\n<p>This was a lot different than my previous articles, and I hope to publish more semi-constructive works about things I find interesting. If you have questions about the IBM PC lineup for some reason, feel free to ask me, I like to think of myself as semi-knowledgeable about them. TM out.</p>\n",
			"date_published": "2024-08-20T00:00:00Z"
		}
		,
		{
			"id": "https://trademarkhell.net/blog/aboutmesections/",
			"url": "https://trademarkhell.net/blog/aboutmesections/",
			"title": "Why Use About Me Sections?",
			"content_html": "<p>If you look at a personal website, odds are you'll see a link on the navbar that goes to something roughly equating to an about me section. At first glance, this does make sense, I mean it's a personal site, you'd want to put details about the person who runs the site on it. However, it's exactly because personal sites are meant to be personal that I oppose about me sections. In everyday conversations you don't get handed a list of bullet points about the person you're talking to, you deduce who they are based on how they act and what they say. I think that personal sites should operate in a similar manner.</p>\n<p>I personally feel as though the way you style your site, the content you choose to put on it, and the way you interact with the people who stumble upon it are a far more accurate indicator of who you are as a person than a single page will ever be. By attempting to depict your entire online identity in the least offensive way possible on a single page, you effectively limit who you can be viewed as. You're defined by how you act, not how you tell people to think of you.</p>\n<p>Internet users as a whole have grown far too used to taking the easiest, least offensive methods to define how they wish to be seen. People will use tone indicators as a way to hide what they really think under the thin veil of &quot;/hj&quot;, refusing to present their opinions in a genuine matter. In my eyes, the modern about me section is just an extension of this, people wanting to be universally liked, and fearing individualism.</p>\n<p>To be disliked by some is to be an individual. There's no such thing as someone without opinions, and there will always be people who oppose the opinions you hold. The discourse that comes from this, whilst unpleasant, is extremely important in helping both parties mature as people.</p>\n<p>Don't hide behind about me sections, or anything else, just present yourself as you are. Some people may like you, some may not, but that's simply how life is. Your online identity is an extension of your person, and at times, it's important to treat it as such. Don't limit who you are just because you fear that someone else may disagree. TM out.</p>\n",
			"date_published": "2024-08-19T00:00:00Z"
		}
		,
		{
			"id": "https://trademarkhell.net/blog/computeraddiction/",
			"url": "https://trademarkhell.net/blog/computeraddiction/",
			"title": "Computer Addiction in the Modern Era",
			"content_html": "<p>I'd like to paint a picture for you all, it's a weekend, you have no work or school to worry about, what do you do? Do you go out and partake in your hobby perhaps, or maybe hang out with friends? No, you obviously sit at your desk and use your computer until you get tired again. This is just theoretical, of course, but if it sounds anything like you, odds are you're a computer addict. Welcome to the club, I guess.</p>\n<p>Computer addiction in and of itself is something that would've seemed incomprehensible just 25 years ago. However, over time computers have gained the ability to do significantly more than they were onced intended to do. This is a process I could probably spend an hour talking bout, but I'll sum it up in a few sentences. Computers used to be expensive, and as such, consumers didn't buy them, so consumer based programs didn't exist. Prices went down as more computers were made, and as such, the number of programs made for consumers increased. A bunch of wacky stuff happens, then bam, the internet, and bam, you have no social interaction outside of your AO3 proofreading Discord Server solely comprised of people living in different timezones.</p>\n<p>The reason so many people can be seen using their computers for absurd amounts of time is because of how much you can do on a computer now. Want to watch a movie or a show? Bet. Want to play some games? I gotchu man. Want to talk with some friends? Bet. Want to get an obscure question about the air vent trim on your E36 325i? Some old guy who's been a BMW technician for 50 years has got you covered. You don't need to go to a library to learn things anymore, you don't need to go out with frinds to hang out anymore. Everything is convenient now, arguably, too convenient.</p>\n<p>Rarely does a day go by where I'm not using my computer for at least a few hours, because I can gain so much knowledge and dopamine from it, so easily. It's just not rewarding to live life as people once did, sitting at your computer all day is objectively a more efficient way to do things. This thought process, however, is pretty terrible.</p>\n<p>The more one grows used to the ease of life a computer brings them, the less one is able to deal with the hardships of everyday life. Why bother having real conversations when you can just DM someone and add &quot;/j&quot; to every message to prevent any consequences to your words? Computers are just another form of escapism, same as any other.</p>\n<p>Escapism, however, isn't always a bad thing, if one were to solely engage in the hardships of daily life, they'd grow insane, the ease of use of the internet provides the perfect compliment to the hardships of daily life. However, when computer usage becomes your everyday life, your life itself begins to lose value. It's very difficult to feel satisfaction when nothing you do had work behind it. I simply feel as though I, along with many others, have grown far too dependent on how easy a life distanced from reality by an LCD screen is.</p>\n<p>This isn't to say computers aren't a brilliant thing, by providing easy access to the internet, we have nearly infinite knowledge at out finger tips, computers are arguably the most useful tool humanity has created in centuries. Yet, computers are merely just that, a tool, something to provide assistance in your everyday life, but not to supplant it. Use computers as an aid for acquiring knowledge and social interaction, but not as your sole method for either.</p>\n<p>As with many things in life, computer usage is excellent in moderation, but terrible in excess. When used in excess you end up writing articles on computer addiction for your personal site, which is a terrible fate. That's all for today, take this one with a grain of salt, it's all based on my opinions, TM out.</p>\n",
			"date_published": "2024-08-18T00:00:00Z"
		}
		,
		{
			"id": "https://trademarkhell.net/blog/webdesignpetpeeves/",
			"url": "https://trademarkhell.net/blog/webdesignpetpeeves/",
			"title": "My Pointless Web Design Pet Peeves",
			"content_html": "<p>Throughout life, I've always been irregularly good at one thing, hating. I usually tend to keep this out of my blog, but these takes were obviously far too important to not share with my loyal 0.5 readers. I've been working on recreational websites for a little over a month and a half now, and whilst I have learned what I like in designing websites, I also learned a lot about what bothers me in web design, in other words, pet peeves. The former is boring, and as aforementioned, I'm a professional hater, so this'll be about the latter.</p>\n<p>I certainly could've introduced the talking points of this article in the first paragraph, but that would almost make this too structured, and structure almost implies that I have valid criticisms, which I don't. So I'll start off here, I have always been irrationally bothered by absurdly large headers, I actually tried using one on this (questionable) webdev attempt:</p>\n<img src=\"https://trademarkhell.net/img/tm16.png\" alt=\" The unpublished version 1.6 of trademarkhell.net \" height=\"600px\" style=\"display: block; margin: 0 auto\">\n<p>I'm a firm believer in substance over style, and this carries over to my current web design philosophy. By having a header which takes up a great deal of screen real estate, you're effectively reducing the functionality your site has prior to scrolling. This is exactly why I believe headers should be small relative to the main content area, for you can use the content to express yourself and add value to your site, as opposed to adding a silly image. Once more, these are all just my unfounded opinions, don't take them too seriously, unless you  agree with them, in which case they're completely evidence backed and real.</p>\n<p>Continuing on the trend of web design pet peeves I've picked up through personal failure, I'll be going over one of the greatest accessibility warcrimes, sites that expand horizontally as opposed to vertically. Just about any monitor of any size can handle a 900px wide site that goes down, but very few monitors can handle a 600px tall site that expands horizontally. Just because it works on your 1440p monitor doesn't mean everyone else should have to use a horizontal scrollbar. I speak from experience:</p>\n<img src=\"https://trademarkhell.net/img/tm152.png\" alt=\"Version 1.5 of trademarkhell.net \" style=\"display: block; margin: 0 auto\">\n<p>As you can see, this is a site largely based on a horizontal layout, which whilst semi-cool looking, resulted in the majority of mobile or laptop users having a less than pleasant experience. This largely loops back to my previous point of substance over style, by making your site vertically built, it may lose some style points, but it gains a great deal of substance in the form of accessibility.</p>\n<p>Now, these previous two points almost had too much backing evidence, so  I feel it's my duty to highlight one of my completely irrational pet peeves, sites with a bunch of gifs and images. I literally have no reason for disliking them, they look cool, but for some reason part of me takes this way too seriously and thinks people should cover their sites in their schizo ramblings instead of photos or whatever. Don't take this as advice from me, it sucks the soul out of your website, I mean, just look at mine.</p>\n<p>Take this article as inspiration if you want, but I'd highly advise not doing so. Web design is meant to be fun, do whatever the hell you want, I just wanted to write this for fun, as my form of web design fun is publishing my stupid ramblings. Have a good one, keep making cool sites, TM out.</p>\n",
			"date_published": "2024-08-17T00:00:00Z"
		}
		,
		{
			"id": "https://trademarkhell.net/blog/carculture/",
			"url": "https://trademarkhell.net/blog/carculture/",
			"title": "Local Car Culture as Viewed by an Idiot",
			"content_html": "<p>I think it's a mandate of every small town to have two things, a car scene solely comprised of riced out economy cars, and an excessive amount of unoccupied retail space. I can't really think of much to say about grocery stores that closed, so this article will be about the former.</p>\n<p>I feel the need to preface this article by saying that I fell into these groups in my younger years (RIP '92 Miata, you were a real one till the end), and this isn't intended to be a criticism of them. If I weren't moving countries in the near future, I'd likely still own a shitbox of some variety (ignoring the fact i still have one). However, it is my duty as someone with an unreasonable interest in poorly modified vehicles to write about them.</p>\n<p>Now, generally speaking, the types of modified vehicles you'll see being driven around in my unnamed hellscape esque small town in the middle of the night can be divided into three categories. The Civic category, the not a Civic category, and the trust fund category. All three of these categories are occupied by teenage drivers of equal inexperience, but are not equal in terms of raw power.</p>\n<p>To start with, let me highlight 'ol reliable,' the Honda Civic, it doesn't really matter what year, it could be 10 years old, it could be 25 years old, the modifications always remain the same. It's mandatory that the engine itself remains untouched, it wouldn't be a true broke secondary schooler vehicle otherwise. Rather, they invest all of their money into absurd 18&quot; shining gold wheels that are usually spaced in a way completely disproportionate to the car body. One mustn't forget the most important component either, an absurdly large wing purchased from eBay, likely held on by adhesive strips. If you're looking to find these drivers, they can generally be found in ditches, and doing 70km on a 25km residential street.</p>\n<p>Now, the second category, in practice, the modifications mentioned in the Civic category remain identical, but rather, the car changes. These are vehicles owned by true contrarians who want to defy societal norms, so instead of buying a Civic, they bought a Miata or a Corolla. These are cars that are objectively worse for a secondary school student, be it in convenience or reliability, but they represent a act of true defiance. Instead of taking to the streets and protesting, they did something braver, driving a mildly diferent vehicle. Deeply inspiring stuff.</p>\n<p>Society is inevitably divided into social classes, this is a fundamental principle of humanity following the agricultural revolution, yet, some people remain in a fringe category between the two. These are those that fall into the trust fund category, those with enough wealth to get an absurd vehicle, yet simultaneously lack the intellect or wealth to attend an educational institution outside of the unremarkable town in which you reside. The trust fund, unsurprisingly maintains the same modifications as the previous categories, but not due to a lack of funds.Rather, they maintain these modifications because they have no idea what they're looking at in the engine bay, and are currently contacting their vehicle's manufacturer to ask about blinker fluid. These pseudo-nepotists can be found driving brand new WRXs, EVOs, and in some cases, Civic SIs.</p>\n<p>None of these categories actually know how to drive, and their semi-annual attempts at street racing result in three cars ending up in a ditch, and them waiting another six months to try and street race again. Those who belong to these categories either mature into automotive enthusiasts who look fondly upon their days as an idiotic student, or simply move on with life and get an unremarkable vehicle as most do.</p>\n<p>This article is of absolutely no substance and I solely wrote it for fun, it's more or less just a way for me to mess with falvor text whilst recounting things I see around time. Thanks for reading this if you did, for some reason, I apopreciate it. TM out.</p>\n",
			"date_published": "2024-08-17T00:00:00Z"
		}
		,
		{
			"id": "https://trademarkhell.net/blog/infoprivacy/",
			"url": "https://trademarkhell.net/blog/infoprivacy/",
			"title": "Personal Information and the Indie Web",
			"content_html": "<p>I think just about everyone has heard the generic preamble about internet privacy before, &quot;blah blah don't say your name and location blah blah,&quot; but, I've begun to notice that some people didn't take this one to heart when it comes to personal sites. So, before I say anything else, please, for the love of god, don't put your location and full legal name on your site, or your age, especially if you're a minor. I keep seeing sites that start with &quot;hey guys i'm 13, my name is [FULL LEGAL NAME], i live in [STATE/PROVINCE/PREFECTURE] and this is my site&quot; and then proceed to link their Discord. Please don't do this, people on the internet are weird.</p>\n<img src=\"https://trademarkhell.net/img/mynameiswalter.jpeg\" alt=\" Walter White from Breaking Bad during his confession \" height=\"300px\" style=\"display: block; margin: 0 auto\">\n(I felt my article would be incomplete if I didn't include a screenshot of this)\n<p>This isn't to say you can't have an about webmaster page (although i also kinda dislike those, but that's another day's article), or write about stuff you like in a blog, but maybe just talk about what you're interested in, rather than the exact person you are. Personal sites, in my opinion, are meant to serve as places to depict who you are based on your interests and actions, rather than based on literal personal information. I think it's extremely important to keep this in mind whenever you do just about anything on your site. As the old saying goes, albeit, I don't think it was meant to be used in this context, &quot;Let your actions speak for themselves.&quot;</p>\n<p>I'm not just saying all this because I'm some fiend for anonymity (I mean I am), but rather, because I think some people are genuinely putting themselves at risk by putting so much info in an easy to access place. The world's a lot smaller than you think it is, especially if you live in a heavily populated country with a lot of internet usage. Keep that in mind. Anyways, TM out, don't dox yourself, bye.</p>\n",
			"date_published": "2024-08-16T00:00:00Z"
		}
		,
		{
			"id": "https://trademarkhell.net/blog/nhk/",
			"url": "https://trademarkhell.net/blog/nhk/",
			"title": "I Owe a Lot to Welcome to the N.H.K.",
			"content_html": "<p>This article spoils A LOT about Welcome to the N.H.K. and isn't really a review of it, it's a bit different than my other articles about anime, but I really wanted to write it.</p>\n<p>Welcome to the N.H.K. is, for all intents and purposes, an unremarkable anime, light novel, and manga series from the 2000s. Featuring animation that didn't age particularly well, time-period correct degeneracy, and a cast of characters, that appear to be rather generic at first glance. I, however, being the brave explorer that I was in 2021, chose to watch it, and to be honest, it was probably one of the best choices I've made in my life, which seems weird to say about an anime.</p>\n<img src=\"https://trademarkhell.net/img/nhk.jpeg\" alt=\" The coverart of the aforementioned Welcome to the N.H.K.\" height=\"500px\" style=\"display: block; margin: 0 auto\"> \n<p>N.H.K. originally released as a light novel in 2002, written by Tatsuhiko Takimoto, and illustrated by Yoshitonshi Abe, it was later adapted into a manga in 2003, which was illustrated by Kenji Oiwa, and into an anime by Studio Gonzo in 2008. I've only seen the anime, and have no intention of experiencing the former two, so it'll be the focus of this article.</p>\n<p>N.H.K. follows Tatsuhiro Satou, everyone's favorite Terry A. Davis esque delusional and suicidal NEET shut-in. The show has several interesting characters, but for the sake of leaving some of the more absurd elements of the show for you, I won't go over them, rather, I'll just highlight the heroine, Misaki Nakahara. Misaki is an equally delusional individual who seeks to somehow save Satou from his NEEThood, yet in the process they just end up making eachother worse. That's it, that's basically the plot of the show.</p>\n<p>I'm sure it seems as though this show is just another piece of fodder to watch or ignore based on what I've said alone, but quite frankly, what happens in the show isn't what makes it so impactful, the bulk of the events in the show solely serve as comedic relief.(blah blah blah mild spoiler warning)</p>\n<p>Rather, what makes the show impactful is how it ends, or more so, how it doesn't. Satou just has to go out and get a minimum wage job, he's still delusional, he still wants to be a NEET, but he has no money. Satou just goes out and becomes a productive member of society, not out of choice, but by necesity. Something about how non-comedic this was as opposed to the rest of the show really stuck with me, especially as someone in a similar position at time, functionally being a NEET due to my university being closed, and seriously considering just dropping everything and doing nothing with the rest of my life but sitting around.</p>\n<p>Being a NEET shut-in always seems appealing to a lot of people, and I think N.H.K. really shows that well, so much of the show is just comedic relief, as if showing why you SHOULD just lock yourself in your room and never leave. Yet, it ends with this slap to your face, that nothing will ever happen if you don't go out and accept life. Satou doesn't seem to be happy about joining the workforce, but he was equally delusional and suicidal as a shut-in.</p>\n<p>If you're going to be unhappy, you may as well be productive while you do it, and at least give yourself a chance to become happy. That's what I took from the show, and quite frankly, I owe my social life and academics to this show, as I probably would've just kept rotting away as I did during COVID if not for the reality check this show gave.</p>\n<p>This isn't that good of a show, and I've barely actually mentioned anything about it, but trust me, there's a lot of impactful elements in it, and a decent bit of funny segments, honestly, if anything I said stuck with you, just watch the show. It'll probably hit a different chord than most of the seemingly &quot;life changing&quot; shows were meant to. This isn't Evangelion, this isn't Cowboy Bepop, it's not some deep freudian psychological thing, it's just a reality check. Tm out.</p>\n",
			"date_published": "2024-08-15T00:00:00Z"
		}
		,
		{
			"id": "https://trademarkhell.net/blog/ssg/",
			"url": "https://trademarkhell.net/blog/ssg/",
			"title": "SSGs Are Good, Actually",
			"content_html": "<p>This article is sorta an addendum to my previous article about people not using blogs, so read that first if you want to. Anyways, people don't seem to like SSGs, as my friend bravely demonstrated here in an act of true determination.</p>\n<img src=\"https://trademarkhell.net/img/ssgslander.png\" alt=\" SSG SLANDER!!!\" height=\"400px\" style=\"display: block; margin: 0 auto\"> \n<p>His brave sacrifice will be immortalized through this article.</p>\n<p>The dislike of SSGs, from my observations seems to stem from two primary sources, people feeling as though it looks too difficult, and people who feel it takes the &quot;fun&quot; out of website creation. For the sake of maintaining rationality, I'll primarily be focusing on the former, until I get bored, in which case I will certainly rant about the latter.</p>\n<p>Now, I fully understand why many people feel as though SSGs look difficult, I mean you're going from a few HTML and CSS files to whatever the hell this is...</p>\n<img src=\"https://trademarkhell.net/img/sitecomposition.png\" alt=\" The file structure of the site you're reading this on\" height=\"800px\" style=\"display: block; margin: 0 auto\"> \n<p>However, the barrier to entry of reading a few docs (or a 6 minute video... https://www.youtube.com/watch?v=kzf9A9tkkl4) is very much worth the ease of use you gain, and nowadays, a lot of static site generators seem to be easy to set up in mere minutes. (I hear good things about Hugo, I of course chose the one SSG with terrible documentation and like two tutorials, shoutout to 11ty). The benefit of using an SSG isn't in how easy they are to set up (in my opinion...), but rather, how easy they make maintaining your site. This whole article is being written on a single markdwon document, I haven't even touched HTML or CSS for it, my SSG does all the work for me, provided I give it the templates needed.</p>\n<p>Building on yesterdays point, and the words of an anonymous commenter that I agree with, a large part of why there's so many untouched blogs on the Indie Web is because of how much work it takes to publish an article without an SSG. People need to manually create new HTML and CSS files, and format the whole thing with HTML text elements, which, speaking from experience, is a pain in the ass.</p>\n<p>I encourage literally anyone looking to update or remake their sites to at least try using an SSG when they do it, all you need to do is follow the documentation and give it a few templates, after that, maintaining your site is as simple as writing. Don't be one of those people that has whole sections of their sites that they update once every two years, use an SSG. It's that easy.</p>\n<p>Alright, before I finish this article up, I feel it's my duty to address the not using an SSG being &quot;fun&quot; part of the argument, and I'll do so in a single sentence. If it's so fun to run your website without an SSG, why do you never post anything???? (and if you do maitnain a blog without an SSG, shoutout to you, but there's something wrong with you)</p>\n<p>TL;DR: SSGs make everything easier and save your firstborn child's life, use them or suffer. Tm out.</p>\n",
			"date_published": "2024-08-14T00:00:00Z"
		}
		,
		{
			"id": "https://trademarkhell.net/blog/useyourblog/",
			"url": "https://trademarkhell.net/blog/useyourblog/",
			"title": "Please Actually Use Your Blog Sections",
			"content_html": "<p>Tm here, if you haven't noticed, I quite like writing blog articles, in fact, I've been publishing them daily since I made this site revision (albeit, i don't expect this pace to continue forever). As such, I feel it is my duty to preach the gospel of article creation, for I've encountered many sites which have entire sections dedicated to this practice, yet rarely, if ever, publish blog articles. I'm here to put a stop to this heresy.</p>\n<p>Contrary to popular belief, running a blog actually serves a purpose outside of filing the section of your site that you had no idea what to do with. In my opinion, blogs are the best way to capture your mental state at a given time. A case could be made for diaries, of course, but diaries merely serve to recount events, not what you truly think from an external perspective. Blogs capture the way you think and act, even if it's just through your writing mannerisms. Furthermore, I feel as though the self restraint induced from publishing blogs publically leads to a more accurate depiction of how one truly behaved at the time.</p>\n<p>In effect, what I'm trying to depict, is that, blogs can actually be useful tools to look back on who you are/were as a person, whilst also honing your writing skills for no real reason. Blogs can be a lot more than obligatory sections on your website that you ignore, and I really hope people realize that. You don't have to make a blog, but honestly, don't bother putting the section on your site if you don't intend to use it. Oh, also, maybe refrain from putting your extremist 4chan political takes on your blogs, just a word of advice. Tm out, this one's a short post, but I have nothing more to say on the matter.</p>\n<img src=\"https://trademarkhell.net/img/osakaism.png\" alt=\"osaka with the autism hat?????'\" height=\"600px\" style=\"display: block; margin: 0 auto\">\n<p>pic unrelated</p>\n",
			"date_published": "2024-08-13T00:00:00Z"
		}
		,
		{
			"id": "https://trademarkhell.net/blog/haruhi/",
			"url": "https://trademarkhell.net/blog/haruhi/",
			"title": "The 2000s Happened; Haruhi Suzumiya",
			"content_html": "<p>blah blah blah; obligatory disclaimer goes here: show discussed was rated 13+ in most countries, putting this here so i don't get sued., thank you COPPA ..</p>\n<p>When people think of the 2000s, they probably think about things like the 2008 recession or the dawn of the new millenium, but I have my priorities in check; I think about anime. More specifically, I think of Kyoto Animation's adaptions of manga, light novels, and visual novels, like Clannad, Kanon, Lucky Star, and The Melancholy of Haruhi Suzumiya. The former three are arguably still relevant today, even if just watched for nostalgia, but curiously, it seems as though Haruhi has largely faded into relative obscurity. I personally think it's a shame that so few people know about Haruhi nowadays, so I'm taking responsibility and preaching the gospel of this show that I really like, despite it having no exceptional characteristics.</p>\n<p>The Melancholy of Haruhi Suzumyia aired it's first season in Spring of 2006, to largely positive reviews. It adapted the light novel series of thes same name, which had it's first novel released in 2003, and is not yet complete. The anime series, however, seems to be significantly better known, and in my opinion, is the superior way to consume the arcs it adapts, and as such, is the focus of this article. Attached below is the art of the movie because I think it goes too hard not to include, and it shows the cast.</p>\n<img src=\"https://trademarkhell.net/img/haruhiposter.jpg\" alt=\"The poster of the movie 'The Disappearence of Haruhi Suzumiya'\" height=\"600px\" style=\"display: block; margin: 0 auto\">\n<p>The show is told from the point of view of Kyon, a character with no actual name, nor a last name. He served as one of the original &quot;straight man&quot; characters in anime, a trend which seems to have become rather common today. Complimenting him is a cast of proportionately, but for the sake of not sucking the joy out of whoever chooses to watch this show, I'll just highlight the namesake of the show, Haruhi Suzumiya. Haruhi is a delusional character with god-like powers who effectively has the ability to do whatever she wants.</p>\n<p>If the final sentence of the last paragraph didn't make it obvious enough, this is, in effect, a show about Haruhi doing whatever she wills, with whoever she wills. In effect, this makes the show a slice of life, and it evidently is, but what makes the show interesting is the fact that Haruhi can do just about anything, and as such, many of the activities diverge from that of the standard &quot;cute girls doing cute things&quot; formula. The show can get pretty batshit insane, in a very good way. I'll attach the clip below as a testament to that.</p>\n<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/x3GgMehORTI?si=mO3lUjgxr9W21T58\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen=\"\" style=\"display: block; margin: 0 auto\"></iframe>\n<p>I could probably provide context to this clip, but instead I'm just going to end my article here. Watch the show. It's aged terribly, but man, when it hits, it hits. Batshit insane slice of life with an interesting cast. It won't be the best show you've ever watched or anything, but it's enjoyable.</p>\n",
			"date_published": "2024-08-12T00:00:00Z"
		}
		,
		{
			"id": "https://trademarkhell.net/blog/polishrock/",
			"url": "https://trademarkhell.net/blog/polishrock/",
			"title": "Top ten worst  interests; Polish Rock",
			"content_html": "<p>As a terminally online individual, who's life revolves around a select group of internet forums and Discord servers, it's my duty to exclusively maintain interests  that are either solely maintained by terminally online people, or maintained by 2.5 people total. As this website probably indicates, I've fulfilled this requirement quite well, and today I'll be talking about one of the stranger ones. Polish Rock.</p>\n<p>A few years ago I played through the game 'SUPERHOT', the most innovative shooter I've played in years, but this isn't about SUPERHOT, rather, it's about the song that played in it's credits, &quot;Psy Pawłowa&quot;, by Republika.</p>\n <iframe frameborder=\"0\" width=\"400\" height=\"60\" src=\"https://drive.google.com/file/d/14l0W9762h2UZpwtEq2mcV5EPUa48b8Yz/preview?usp=drivesdk\">\n</iframe>\n<p>In hindsight, this is honestly one of the weaker songs on Republika's discography, but I think it's important for the rabbithole it led me down. It effectively made me realize that music I couldn't understand was actually pretty good, and opened the floodgates of Polish rock to me, as opposed to the same few Chinese and Japanese songs I was listening to at the time.</p>\n<p>Ironically, I still have no real interest in learning Polish, but, I have continued to discover many more bands and songs hailing from Poland. Just to list off a few, Turbo has a pretty strong discography, with nearly all the songs from their '00 album &quot;Remix 92&quot; sounding really good, and Kazik na Żywo has a really good collection of grunge-esque songs, albeit, the mastering on some of them leaves something to be desired (also pretty similar to grunge songs of the era...)</p>\n<p>Republika has still remained my favorite of the Polish bands I've heard, perhaps because they were the first, or perhaps due to the sheer number of songs they have. My favorites are easily &quot;Fast (New)&quot;, and &quot;Raz na milion lat&quot;. The latter of which is one of my favorite songs of all time.</p>\n<p>Now, despite this article largely being about my dumb interests and such, I would like for the 0.5 people reading this to at least consider listening to music from regions and languages outside of where they reside. It can be a really interesting experience, and if you're lucky (or unlucky), you may actually like the music. Anyways, that's it for today's rambling session, thanks for coming. Leave your bingoboards where you picked them up.</p>\n",
			"date_published": "2024-08-11T00:00:00Z"
		}
		,
		{
			"id": "https://trademarkhell.net/blog/indieweb/",
			"url": "https://trademarkhell.net/blog/indieweb/",
			"title": "The Indie Web Described By a True Idiot",
			"content_html": "<p>As of late( well not really, more so for the past 15 years ), the concept of the 'Indie Web' has been in resurgence, with many seeking to partake in an internet free of the constraints of corporations or ruling powers, as the internet once was. Despite this, I'd argue that the term 'Indie Web' has really lost it's original meaning.</p>\n<p>This term suggests that these websites are truly independent from external influence, yet, the majority of self-declared 'Indie' sites are still being hosted on services such as Neocities or Nekoweb, both of which have their own external rules and the ability to delete/moderate sites. These rules, of course, exist for reasons, but it's because of this external influence that I feel it's disingenous to say that these websites are truly 'Indie'.</p>\n<p>In the modern sense being an independent site seems to be more of a design philosophy than that of a literal thing. The 'Indie Web' seems to be defined by sites, which, for lack of better terminology, serve no real purpose. Take this site for example, it just serves to host my pretentious ramblings. The purposes of these sites suit their owners and, at times, a select group of people, but rarely venture outside of that small niche.</p>\n<p>What I'm trying to say is that, in effect, 'Indie Web' no longer means websites independent from external influence, rather, it means sites made for self indulgence, sites made for recreation rather than for profit, sites made by hobbyists, for hobbyists. Despite losing it's original meaning, I'd argue that the concept of the 'Indie Web' is stronger than ever, with more websites made for leisure existing now than there has been in years.</p>\n<p>Furthermore, I'd like to specify that this article is not a criticism of the 'Indie Web' whatsoever, given I'm an avid participant in the community. This article merely serves to provide an exteremly unscientific, and unproven theory as to what the 'Indie Web' truly is, in it's current evolution. Albeit, I suspect that the defenition of the 'Indie Web' will continue to change for as long as people continue to make websites for non commercial use.</p>\n",
			"date_published": "2024-08-10T00:00:00Z"
		}
		,
		{
			"id": "https://trademarkhell.net/blog/monogatariseries/",
			"url": "https://trademarkhell.net/blog/monogatariseries/",
			"title": "My Irrational Love for Monogatari",
			"content_html": "<p>blah blah blah; obligatory disclaimer goes here: show discussed was rated 18+ in most countries, putting this here so i don't get sued., thank you COPPA ..</p>\n<p>The Monogatari Series, published originally in light novel form by Nisio Isin in 2005, adapted into a manga by Oh! Great in 2013, and adapted into an anime by Studio Shaft in 2009 is probably one of the most, if not the most problematic series to come out of Japan. I've consumed the series in all of these formats numerous times, but for the sake of accessibility to the bulk of people, I'll be predominantly highlighting the first season of the anime, for the sake of convenience, and for the sake of spoilers.</p>\n<p>After that nightmare of a starting sentence, you're probably wondering what exactly is so bad about this series, and why I'm shilling it to you. I don't really intend to tone down what's wrong about this series, in fact, I'll summarize it in a single sentence. I genuinely think it's impossible to find a series that juxtaposes masterful wriiting with pure degeneracy like the Monogatari series. There's plenty of other problematic shows, but people solely watch them because they're problematic, so they don't exactly fall into the same category as Monogatari.</p>\n<p>I could probably go on and on about what's wrong with this series, but quite frankly, there's plenty of people who've done it better than me, including the first 30 seconds of the show, find the show on your streaming service of choice, or elsewhere, and watch the first 30 seconds of Bakemonogatari, I was going to attach it here, but then I realized that my website host probably wouldn't appreciate that, so come back after you do that, or don't, I'm not your dad.</p>\n<p>Now, before I expalin what I like about the series (and there's a lot), I feel I should probably give some context as to who I was when I first consumed it, you see, I was the prime demographic for being able to ignore all of the borderline insanity I mentioned above, I was in my early teens. Quite frankly, I probably wouldn't touch the show with a 50 meter pole if I didn't get into the series then, as I don't think I'd be able to turn a blind eye to a lot of the things in the show if I watched it for the first time now.</p>\n<p>Okay, okay, the four paragraphs of disclaimers are done, I can get into what I wanted to write this for, now. I think the Monogatari Series has some of the most compelling characters, and easily, the best animation style of any modern anime. This show relies heavily on 25 minute long episodes that are solely comprised of a few monologues, or a single conversation, yet it's because of how fleshed out these characters are that they don't feel boring, it genuinely feels as though you're watching a standard conversation. Studio Shaft, however, not wanting for the viewer to get bored, relies on a visual style unlike any other series (except for other Shaft series) to provide visual stimulation to the watcher.</p>\n<p>I obviously can't simply attach a full episode here to demonstrate the style, so instead, here's a trailer to the prequel of the series, which still shares that distinctive visual style:</p>\n<iframe style=\"display: block; margin: 0 auto\" frameborder=\"0\" width=\"560\" height=\"315\" src=\"https://drive.google.com/file/d/1LEEczLPFlvbKm8x4PSBoJ6aYjA-hsR0y/preview?usp=drivesdk\">\n</iframe>\n<p>I honestly would love to ramble on about this franchise for ages, but quite frankly, if what I said didn't make you hate the show, then you should watch it, if it did, then don't. That's basically it. I did what I could to shill it, and also did what I could to scare you away from it. My job here is done, I think..</p>\n",
			"date_published": "2024-08-07T00:00:00Z"
		}
		,
		{
			"id": "https://trademarkhell.net/blog/ihatewebdesign/",
			"url": "https://trademarkhell.net/blog/ihatewebdesign/",
			"title": "Failure and Webdesign",
			"content_html": "<p>About three weeks ago now, in the middle of July, I came to a sudden revelation, one, which, for a lesser man, may have caused great mental distress. I realized that my website completely sucked, was borderline impossible to modify, and was almost illegible. I, however, being the brave warrior that I am, chose not to let this decrease my morale, and instead set off on a brave journey to improve my site.</p>\n<p>For context, allow me to present the website that I had at the time.</p>\n<img src=\"https://trademarkhell.net/img/tm152.png\" alt=\"Version 1.5 of trademarkhell.net \" style=\"display: block; margin: 0 auto\">\n<p>It's not bad... per se, especially given it was the product of me learning html the day before, but it's not good. It's very obviously the product of someone with little to no knowledge of compatability and the fundamentals of webdesign. I built content out horizontally instead overtically because I thought it looked cool, but that also meant that anyone with a monitor smaller than 1080p had to scroll to the side. I also had the brilliant idea of making the site yellow, orange, and white, which whilst pretty good for creamsicles, is god-awful for websites. Reading this site is a similar experience to trying to read grey text on a black background whilst wearing sunglasses. It was also built with no knowledge of flexbox, solely relying on CSS Grids, and no static site generator, so it was basically impossible for me to add more content to it.</p>\n<p>In a lot of ways, it was a fitting site for what it was, a site in it's infacy, and similar to infants, it was pretty useless. In an exercise of great stupidity, I thought that the best way to fix this was to suck any personality the site had out of it. I created a soulless husk of a website that was solely black and white, which had a layout that served no purpose outside of being utilitarian. Shockingly, a personal website that's meant to express your creativity that was made with no creativity isn't that appealing, here's a photo of it:</p>\n<img src=\"https://trademarkhell.net/img/tm16.png\" alt=\" The unpublished version 1.6 of trademarkhell.net \" height=\"500px\" style=\"display: block; margin: 0 auto\">\n<p>Thankfully, I quickly realized that Melankorin may be the only one actually able to make a visually appealing monochrome site, and quickly moved onto my next valiant attempt at webdesign, not yet feeling dejected (which I soon would be). For this layout, I thought, logically, if colorful backgrounds for text were too much, and if black and white was too boring, why not make the best of both worlds. This then led me to what may be the ultimate example of style over substance. It's cool, I won't deny that, but nothing really &quot;clicked&quot; for me with this site, it just, wasn't what I wanted. I admittedly don't have much to say about it, but here it is, even more unfinished than the last layout:</p>\n<img src=\"https://trademarkhell.net/img/tm17.png\" alt=\" The unpublished version 1.7 of trademarkhell.net \" height=\"500px\" style=\"display: block; margin: 0 auto\">\n<p>We're now stepping into the territory of layouts I have literally no memory of making, so this should be interesting. At this point I was so engrossed in making the perfect website, that I wasn't even drafting layouts on paper anymore, I was just making them and crossing my fingers, and this also meant that I was making even less progress before dropping them immediately. There was about four layouts I did this for, and quite frankly they're all so unfinished that I don't feel the need to attach more than one image, but, here it is, the pinnacle of modern webdesign (i honestly don't know what this was meant to be???):</p>\n<img src=\"https://trademarkhell.net/img/tmv17.png\" alt=\" The unpublished version 1.8 of trademarkhell.net \" height=\"500px\" style=\"display: block; margin: 0 auto\">\n<p>At this point, I had more drafts of webdesigns on paper than I could count, thinking that if my previous attempts didn't work, I'd surely get a sudden revelation at some point, but, I never did, and so, I randomly picked a layout, and now that layout is the site you're on. I don't really &quot;like&quot; this layout, but, it meets the bare minimum of what I wanted. It has color, but not too much. It has visual elements, but not too many. It has various templates for webpages, but not too many. I'll redo this website eventually, but the issue is, I can't find anything wrong with this layout, I don't like it, but I don't know why.</p>\n<p>This layout, in my eyes, is a failure, but to be fair, so were all the previous ones, I suspect webdesign for me will always be me chasing the high I think i'll get if I make a website I like,  I don't know if that will ever happen, but I'm glad it probably won't, as it gives me a reason to keep working on websites, which others seem to like. Anyways, thanks for reading this ramble, my other posts should be more interesting, but I've wanted to write this one since my first failed layout.</p>\n",
			"date_published": "2024-08-06T00:00:00Z"
		}
		,
		{
			"id": "https://trademarkhell.net/blog/lowqualityoldtech/",
			"url": "https://trademarkhell.net/blog/lowqualityoldtech/",
			"title": "(my obsession with) Crappy Old Tech",
			"content_html": "<p>I accidentally procured the extremely unfortunate hobby of collecting and restoring old technology, I'll probably write more extensively about this in another article, but that's not related to the point. Despite this hobby, some of my favorite pieces of technology are the arguably worthless pieces of low-quality black plastic that came out from the late 80s to the late 90s, that I've done aproximately zero work on.</p>\n<p>These things have absolutely zero reason to still work, they were made using extremely primitive computerized systems, that honestly had no place being in them, yet, for some reason, they seem impossible to kill.</p>\n<p>Take this TV, it's a 13&quot; RCA CRT that probably costed about 50 bucks new. It has no connections on it other than RF, and has remarkebly below average (but not bad!) video quality. It's been sitting to my right on my desk, playing random anime, everyday, for at least five hours, for five years now, and god knows what it went through before I got it.</p>\n<img src=\"https://trademarkhell.net/img/tmcrt.jpg\" alt=\" My 13 inch RCA CRT \" height=\"400px\" style=\"display: block; margin: 0 auto\">\n<p>This is insignificant enough that I didn't even bother moving it from it's eternal resting place to take a photo of it, I feel it's extremely important that I capture this device with it's natural lighting, and natural positioning. I legitimately have no idea why this thing still works, but I'll be sad when it stops working. The black magic that keeps this thing alive, along with many other devices that had the misfortune of being created in the &quot;shitty black plastic&quot; era of technological design is exactly why I love them so much.</p>\n<p>Now, I do feel it's my duty to reflect that, despite the title of this article, some of these &quot;crappy&quot; pieces of old tech are held in high regard. Take this attached photo (ignore the cassette deck on top, that is actual crap but i love it dearly)</p>\n<img src=\"https://trademarkhell.net/img/tmhifi.png\" alt=\" My desks HiFi Stack \" height=\"400px\" style=\"display: block; margin: 0 auto\">\n<p>Picutred above (but below the cassette deck, once again, it still sucks, once again, I still use it daily and love it) is the Luxman R-115, something, which to the layman, is a prime example of black plastic crap. Despite it's appearence, however, it's generally regarded as one of the best amplifiers of the late 80s. I'm listening to it as I write this article, and it's powered the speakers I use with my computer for years now, and I strongly agree with this statement. It doesn't look nearly as good as the silver faced equipment I use in my main HiFi stack, but man, it sounds good.</p>\n<p>Despite the inherently satirical nature of the title of this article, I feel it's my duty to &quot;enlighten&quot; the masses that despite the awful appearence of technology from this era, it really holds up, and sometimes, it's even good. I have a lot more tech from this era that I use often, but this article would be pointlessly long if I covered them. Basically, TLDR, ugly old tech cool, ugly old tech good.</p>\n",
			"date_published": "2024-08-05T00:00:00Z"
		}
		,
		{
			"id": "https://trademarkhell.net/blog/breakcore/",
			"url": "https://trademarkhell.net/blog/breakcore/",
			"title": "Yeah, Breakcore Sucks (but i love it)",
			"content_html": "<p>Breakcore, the official genre of 20-something NEETs that describe themselves as &quot;lainpilled femcels&quot; and use PFPs of Tomoko from WataMote in their extremist political Discords. This genre (according to the reputable source of Wikipedia) traces it's routes to the mid 90s, stemming from jungle, drum and bass, and other relatively small gneres, however, this form of Breakcore is so detached from what many consider to be modern Breakcore that I'll be skipping to the 2000s.</p>\n<p>Alright, picture this, it's the late 2000s, you have to pick between three CDs, first, we have the objectively good CD, &quot;Graduation&quot; by Kanye West, with it's bright album art, but obviously, you won't pick this one, because you're here on this article. Beside it, you have &quot;Detrimentalist&quot; by Venetian Snares, which dawns fittingly complex album art, and &quot;tomboyish love for daughter&quot; by Goreshit, which featurees album art that is likely illegal in several regions. The latter two, in my opinion, represent the two quintessential Breakcore albums of the 2000s that led to the two branching Breakcore sub-genres that we see today.</p>\n<img src=\"https://trademarkhell.net/img/2x1.png\" alt=\" The album art of Detrimentalist by Venetian Snares and toboyish love for daughter by Goreshit \" height=\"300px\" style=\"display: block; margin: 0 auto\"> \n<p>Now, I know what you're thinking &quot;what tf makes thse albums important&quot; and &quot;wtf is that goreshit album art.&quot; I'll get to the first point briefly, but the album art is, you guessed it, cropped Touhou hentai. This is truly a genre defined by it's classiness and maturity. Now, back to the first point, these albums, whilst quite good, are arguably most important due to the cultural split they caused in breakcore. Take this song from Goreshit's album, titled &quot;strawberry cheesecake&quot;:</p>\n<iframe frameborder=\"0\" width=\"400\" height=\"60\" src=\"https://drive.google.com/file/d/1Ps5KFM_7DbCy-CoMHW99eNLHELdnY7Jx/preview?usp=drivesdk\">\n</iframe>\n<p>And then compare it to this song, &quot;Gentlemen&quot; by Venetian Snares:</p>\n<iframe frameborder=\"0\" width=\"400\" height=\"60\" src=\"https://drive.google.com/file/d/1MuksT2iE1mdgb-bE6yJJA-VQm7L8UKQ0/preview?usp=drivesdk\">\n</iframe>\n<p>These songs, despite both being Breakcore, due to their usage of the Amen Break, arguably couldn't be any more different. Goreshit leans heavily towards sampling sounds and music from Anime, a trend that continues today in Breakcore through artists such as Rori in early 20s, and to a limited degree, through Sewerslvt's works (although it can be argued that the majority of her music isn't breakcore, and I largely agree with this). The latter represents a more traditional form of Breakcore, which is the other side of the modern Breakcore coin, being evident through artists such as Machine Girl, and once again, to a lesser extent, Nanoray.</p>\n<p>I personally enjoy both genres of Breakcore, being a terminally online individual, but the point of this article wasn't really to say that &quot;yeah i kinda like breakcore lol&quot;, but rather, to demonstrate the sheer variety of Breakcore artists and songs. Many people do disregard Breakcore, for good reason, but for those that haven't already, listen to some, you'll probably like at least some of it, unless you don't, in which case, it's not my problem.</p>\n",
			"date_published": "2024-08-05T00:00:00Z"
		}
		
	]
}
